yearb=int(input("введите год своего рождения"))
if (yearb-1900)%12==0:
    print ("вы, по китайскому календарю-Крыса")
if (yearb-1901)%12==0:
    print ("вы, по китайскому календарю-Бык")
if (yearb-1902)%12==0:
    print ("вы, по китайскому календарю-Тигр")
if (yearb-1903)%12==0:
    print ("вы, по китайскому календарю-Кролик")
if (yearb-1904)%12==0:
    print ("вы, по китайскому календарю-Дракон")
if (yearb-1905)%12==0:
    print ("вы, по китайскому календарю-Змея")
if (yearb-1906)%12==0:
    print ("вы, по китайскому календарю-Лошадь")
if (yearb-1907)%12==0:
    print ("вы, по китайскому календарю-Овца")
if (yearb-1908)%12==0:
    print ("вы, по китайскому календарю-Обезьяна")
if (yearb-1909)%12==0:
    print ("вы, по китайскому календарю-Петух")
if (yearb-1910)%12==0:
    print ("вы, по китайскому календарю-Собака")
if (yearb-1911)%12==0:
    print ("вы, по китайскому календарю-Свинья")
